from datetime import datetime
days = {
    'Monday': {
        830: 'Громадянська освіта',
        925: 'Фізика',
        1020: 'Математика',
        1125: 'Хімія',
        1230: 'Інформатика',
        1325: 'Захист України',
        1420: 'Історія України',
    },
    'Tuesday': {
        830: 'Фізична культура',
        925: 'Математика',
        1020: 'Історія України',
        1125: 'Біологія',
        1230: 'Українська Література',
        1325: 'Іноземна мова (англійська)',
        1420: 'Українська мова',
        1600: 'Індивідуальні заняття з математики'
    },
    'Wednesday': {
        830: 'Математика',
        925: 'Фізичная культура',
        1020: 'Всесвітня історія',
        1125: 'Іноземна мова (англійська)',
        1230: 'Фізика',
        1325: 'Українська мова',
        1420: 'інформатика',
    },
    'Thursday': {
        830: 'Географія',
        925: 'Математика',
        1020: 'Біологія',
        1125: 'Українська мова',
        1230: 'Іноземна мова (англійська)',
        1325: 'Українська Література',
        1420: 'Історія України',
        1515: 'Фізична культура'
    },
    'Friday': {
        830: 'Громадянська освіта',
        925: 'Фізика',
        1020: 'Зарубіжна література',
        1125: 'Іноземна мова (англійська)',
        1230: 'Українська мова',
        1325: 'Мистецтво',
        1420: 'Мистецтво',
    },
    'Saturday': {

    },
    'Sunday': {

    }
}


def what_is_lesson_now(day, time):
    for i in days[day]:
        if time <= i:
            return days[day][i]
    return 'Уроки на сегодня закончились!'
